# ДОМАШНЕЕ ЗАДАНИЕ СЕМИНАР1 ЗАДАЧА5
##########################################################################################################

# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между 
# ними в 2D пространстве.

def Distance(a1, a2, b1, b2):
    vector1 = a2 - a1
    vector2 = b2 - b1
    result = round(((vector1 ** 2 + vector2 ** 2) ** 0.5), 2)
    return result

pointA1 = float(input('Введите координаты точки A1: '))
pointB1 = float(input('Введите координаты точки B1: '))
pointA2 = float(input('Введите координаты точки A2: '))
pointB2 = float(input('Введите координаты точки B2: '))

lenghtPoints = Distance(pointA1, pointA2, pointB1, pointB2)
print(f'Расстояние между точкой A({pointA1}, {pointA1}) и точкой B({pointA2}, {pointB2}) равно {lenghtPoints}')

##########################################################################################################
