# ДОМАШНЕЕ ЗАДАНИЕ СЕМИНАР1 ЗАДАЧА2
##########################################################################################################

# (!!!Доп!!!) Напишите программу для проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех 
# значений предикат.

def Checking(i, j, k):
    for i in range(2):
        for j in range(2):
            for k in range(2):
                print(f'({i},{j},{k}) {(not(i or j or k)) == ((not i) and (not j) and (not k))}')

numI, numJ, numK = 0, 0, 0
res = Checking(numI, numJ, numK)

##########################################################################################################