# ДОМАШНЕЕ ЗАДАНИЕ СЕМИНАР3 ЗАДАЧА4
##########################################################################################################

# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10
# - 19 -> 10011

def DecimalInBinary(n):
    if n != 0:
        DecimalInBinary(n // 2)
        print(n % 2, end='')

num = int(input('Введите целое число: '))
DecimalInBinary(num)

##########################################################################################################