# ДОМАШНЕЕ ЗАДАНИЕ СЕМИНАР3 ЗАДАЧА5
##########################################################################################################

# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] [Негафибоначчи]

def Negafibonacci(k):
    lt = [0]
    n1, n2 = 0, 1
    
    for i in range(1, k + 1):
        n1, n2 = n2, n1 + n2
        lt.append(n1)
        if i % 2 == 0:
            lt.insert(0, (-n1))
        else:
            lt.insert(0, n1)

    return lt

num = int(input('Введите выражение длины ряда: '))
list = Negafibonacci(num)
print(list)

##########################################################################################################