# ДОМАШНЕЕ ЗАДАНИЕ СЕМИНАР4 ЗАДАЧА1
##########################################################################################################

# Пользователь вводит число, Вам необходимо вывести число Пи с той точностью знаков после запятой, сколько 
# указал пользователь(БЕЗ round())

def LengthNumberPiVar1(lenPi):   
    piValue = '1415926535897932384626433832795028841971693993751058209749445923078164062862089986280348253421170679'
    count = 0

    print('3,', end='')
    for i in piValue:
        count += 1
        print(i, end='')
        if count == lengthPi:
            break

def LengthNumberPiVar2(lenPi):   
    piValue = '1415926535897932384626433832795028841971693993751058209749445923078164062862089986280348253421170679'
    # Через срез строки
    print('3,' + piValue[:lengthPi])

lengthPi = int(input('Введите необходимую длину части после запятой числа Пи: '))
LengthNumberPiVar1(lengthPi)
print()
LengthNumberPiVar2(lengthPi)

##########################################################################################################