# ДОМАШНЕЕ ЗАДАНИЕ СЕМИНАР4 ЗАДАЧА4
##########################################################################################################

# Задана натуральная степень k. Сформировать случайным образом список коэффициентов (значения от 0 до 100) 
# многочлена и вывести многочлен степени k.
# Пример:
# - k=2 => 2*x² + 4*x + 5 
# k = 6
#     ix^6 + ax^5 + bx^4+ cx^3 + dx^2 + ex + h
#     a, b, c, d, e, h - рандом

import random

def Polinominal(num):
    for i in range(num, 1, -1):
        print(random.randint(0, 100), '*x^', i, ' + ', sep='', end='')
    print(random.randint(0, 100), '*x', sep='', end='')
    print(' + ', random.randint(0, 100), sep='')

k = int(input('Введите степень: '))
Polinominal(k)

##########################################################################################################