# ДОМАШНЕЕ ЗАДАНИЕ СЕМИНАР4 ЗАДАЧА2
##########################################################################################################

# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# N = 6 |   N = 12  |         32        | 13 |   9   |     18    | 21
# 2 * 3 | 2 * 2 * 3 | 2 * 2 * 2 * 2 * 2 | 13 | 3 * 3 | 2 * 3 * 3 | 3*7

def CalculationPrimeFactors(n):
    list = []

    while n != 1:
        for i in range(2, num + 1):
            if n % i == 0:
                list.append(i)
                n //= i
                break

    return(list)
       
num = int(input('Введите число: '))
print(*CalculationPrimeFactors(num), sep=' * ')

##########################################################################################################