# ДОМАШНЕЕ ЗАДАНИЕ СЕМИНАР6 ЗАДАЧА2
###############################################################################
# Все задачи решать с помощью использования лямбд, filter, map, zip, enumerate, 
# List Comprehension
# 2) Дан список, вывести отдельно буквы и цифры, пользуясь filter.
# [12,'sadf',5643.5] ---> ['sadf'] ,[12,5643.5]
###############################################################################

data = [12, 'sadf', 5643.5]
print('Исходный список: ', data)
strings = list(filter(lambda i: type(i) == str, data))
numbers = list(filter(lambda i: type(i) == int or type(i) == float, data))
print(f'Буквы: {strings}, цифры: {numbers}')

###############################################################################